
interface IMessage {
    [key: string]: string 
}

export const respMessage : IMessage= {
    '10000': '账号或密码错误',
    '10001': '旧密码错误',
    '10002': '文件格式错误',
    '10003': '文件删除失败',
    '10004': '账号已禁用',
    '10005': '超管用户禁止删除',
    '10006': '超管角色禁止删除',
    '10007': '商户角色禁止删除',
    '10008': '该账号已经存在',
    '40000': '支付通道不存在',
    '40001': '暂无可用通道',
    '40002': '主键不存在,不可以修改',
    '40003': '支付上游商户不存在',
    '11012': '暂无权限',
    '11015': 'TOKEN已失效',
    '1500': '服务器异常',
    '11051': '暂无权限',
    '11016': 'Token失效',
    '10030': '代理不存在',
    '10031': '代理钱包余额不足',
    '10032': '账户已禁用',
    '10033': '非代理不能添加支付方式',
    '10034': 'id必须参数不能为空',
    '10035': '非代理不能添加快捷回复',
    '10036': '代理订单不存在',
    '10037': '此代理订单不能上分,请联系客服',
    '10038': '没有代理在线，请选择其它充值方式',
    '10039': '验证码错误',
    '11014': '该账号已在其他位置登录',
    
    

}